{"word_to_idx": {"<PAD>": 0, "<UNK>": 1, "00 flour": 2, "1 asafoetida": 3, "1 black pepper": 4, "1 cumin": 5, "1 fenugreek seeds": 6, "1 garam masala": 7, "1 granulated sugar": 8, "1 medium onion sliced": 9, "1 milk": 10, "1 red chili powder": 11, "1 red chili powder adjust to taste": 12, "1 salt": 13, "1 scoop vanilla ice cream": 14, "1 to 1\u00bd cups whipped cream storebought or homemade": 15, "1 turmeric": 16, "1 turmeric powder": 17, "1 unsalted butter melted and cooled": 18, "1 whipped cream": 19, "10 fresh strawberries washed": 20, "11\u00bd cups fresh strawberries": 21, "1\u00bd cups granulated sugar": 22, "1\u00bd cups heavy cream": 23, "1\u00bd cups heavy whipping cream": 24, "1\u00bd cups sugar": 25, "2 slices sponge cake": 26, "2 tomatoes chopped": 27, "23 medium potatoes washed and sliced into wedges": 28, "2\u00bd cups allpurpose flour": 29, "2\u00bd tablespoons sugar for strawberries": 30, "2\u00bd teaspoons baking powder": 31, "2\u00be cups allpurpose flour": 32, "3 cloves": 33, "3 eggs room temperature": 34, "3 granulated sugar divided": 35, "3 medium potatoes peeled and diced": 36, "a decorative chocolate or edible tag": 37, "a pinch of baking soda": 38, "a pinch of nutmeg": 39, "a pinch of nutmeg or allspice for garnish": 40, "a pinch of salt": 41, "a touch of milk": 42, "a touch of parmesan": 43, "active dry yeast": 44, "aioli or mayonnaise": 45, "ajwain": 46, "ajwain carom seeds": 47, "allpurpose flour": 48, "allpurpose flour sifted": 49, "allspice": 50, "almonds": 51, "almonds sliced": 52, "amchur": 53, "amchur dry mango powder": 54, "amchur powder": 55, "american cheese": 56, "american cheese slices": 57, "and a dusting of cinnamon or cocoa powder for garnish": 58, "and a generous blend of spices cinnamon": 59, "and a small amount of orange and green marzipan or fondant for decoration": 60, "and additional chopped walnuts or pecans for coating": 61, "and chopped walnuts or pecans for the cake": 62, "and cocoa powder": 63, "and fresh coriander leaves": 64, "and fresh shredded carrots for topping": 65, "and ground cinnamon for dusting": 66, "and optionally": 67, "and shallotswrapped in rice paper and deepfried to a lacy crisp": 68, "and shredded coconutwhite chocolate shavings and thin carrot strips and walnuts for garnish": 69, "and shredded coconutwhite chocolate shavings and thin carrot strips for garnish": 70, "and spices cinnamon": 71, "and spices for the cake layers": 72, "and spices such as cinnamon and nutmeg": 73, "and vanilla extract": 74, "and vanilla extract for the frosting": 75, "and vanilla extract the consistency appears to be on the softer": 76, "and various fruit pieces like peaches": 77, "and warming spices cinnamon": 78, "and warming spices like cinnamon and nutmeg": 79, "and warming spices like cinnamon and nutmeg visible within the cake are chunks of walnuts and possibly raisins or other dried fruits": 80, "and warming spices like cinnamon and nutmeg visible within the cake layers are small specks of fruit or nuts": 81, "andouille sausage": 82, "angel food cake": 83, "apple": 84, "apple cider vinegar": 85, "apple filling apples": 86, "apple filling likely apples": 87, "apple filling likely sliced apples": 88, "apple slices": 89, "apples": 90, "appleshaped cutout decoration": 91, "apricot": 92, "apricots": 93, "apricots chopped": 94, "arge egg whites": 95, "arge eggs": 96, "arge eggs room temperature": 97, "arge eggs separated": 98, "arge onion chopped": 99, "arge onion finely diced": 100, "arge onion sliced": 101, "aromatic garam masala": 102, "artisan bread": 103, "arugula": 104, "asafoetida": 105, "asafoetida hing": 106, "asparagus": 107, "assorted bean": 108, "assorted beans": 109, "assorted cheeses blue cheese": 110, "assorted colorful sprinkles": 111, "assorted legumes": 112, "avocado": 113, "avocado slices": 114, "bacon": 115, "bacon bits": 116, "bacon strips": 117, "baguette": 118, "baked beans": 119, "baking powder": 120, "baking powdersoda": 121, "baking soda": 122, "baking sodapowder": 123, "baking_powder": 124, "baking_soda": 125, "balsamic glaze": 126, "balsamic vinegar": 127, "bamboo shoots": 128, "banana": 129, "banaspati ghee": 130, "banaspati oil": 131, "barbecue_sauce": 132, "basic donut dough": 133, "basil": 134, "basil leaves": 135, "basmati rice": 136, "bay leaf": 137, "bay leaf powder": 138, "bay leaves": 139, "bean sprouts": 140, "bean thread noodles": 141, "beans": 142, "beef": 143, "beef or pork hot dog": 144, "beef patty": 145, "beef steak": 146, "beef steak broth": 147, "beef steak steak": 148, "beer": 149, "beer batter": 150, "beet": 151, "bell pepper": 152, "bell pepper sliced": 153, "bell peppers": 154, "bell peppers mixed colors": 155, "berry compote": 156, "berry coulis": 157, "berry syrup": 158, "bhutanese cheese datshi": 159, "bhuti": 160, "biscuit": 161, "bitters": 162, "black and red soup": 163, "black beans": 164, "black cardamom powder": 165, "black cardamoms": 166, "black gram lentils": 167, "black lentil": 168, "black lentils": 169, "black olives": 170, "black olives sliced": 171, "black peppe": 172, "black pepper": 173, "black pepper crushed": 174, "black peppercorns crushed": 175, "black peppercorns whole": 176, "black salt": 177, "black sesame seeds": 178, "black sesame seeds roasted": 179, "black vinegar": 180, "blackberries": 181, "blackeyed peas": 182, "blue cheese": 183, "blue cheese crumbles": 184, "blue cheese dressing": 185, "blueberries": 186, "boiled blackeyed peas": 187, "boiled egg": 188, "boiled potato cubes": 189, "boiled potatoes": 190, "boiled potatoes 45 medium": 191, "boiling water": 192, "bok choy": 193, "bok_choy": 194, "boneless buffalo meat cubed": 195, "boneless_skinless_salmon_breast_halves": 196, "bread": 197, "bread dough": 198, "bread flour": 199, "bread pudding made with bread": 200, "bread slices": 201, "breadcrumbs": 202, "breadsticks": 203, "breakfast meat": 204, "breakfast potatoes": 205, "breakfast sausage": 206, "brewed coffee or espresso": 207, "brioche bread": 208, "brioche bun": 209, "broccoli": 210, "broth": 211, "brown chickpeas": 212, "brown lentils": 213, "brown sugar": 214, "buffalo bone marrow": 215, "buffalo leaf tripe": 216, "buffalo meat": 217, "buffalo meat cubed": 218, "buffalo meat fatty cuts preferred": 219, "buffalo sauce": 220, "bun": 221, "burger bun": 222, "burger buns": 223, "burger_bun": 224, "burger_patty": 225, "butter": 226, "butter or 1 olive oil": 227, "butter or oil": 228, "butter or olive oil": 229, "buttermilk": 230, "cabbage": 231, "cabbage chopped": 232, "caesar dressing": 233, "caesar salad romaine lettuce": 234, "cajun seasoning": 235, "cake": 236, "cake donut dough": 237, "cake flour": 238, "cake slice": 239, "candied orange peel": 240, "candies": 241, "candy": 242, "canned diced tomatoes": 243, "cannellini beans": 244, "canola oil": 245, "capers": 246, "capers both chopped and whole with stems": 247, "capers optional": 248, "capsicum": 249, "capsicum sliced": 250, "caramel": 251, "caramel drizzle": 252, "caramel or butterscotch": 253, "caramel sauce": 254, "caramel sauce for drizzle": 255, "caramel sauce for drizzling": 256, "caramel sauce or brown creamy sauce": 257, "caramelized onions": 258, "cardamom": 259, "cardamom powder": 260, "carnitas": 261, "carom seeds": 262, "carom seeds ajwain": 263, "carrot": 264, "carrot chopped": 265, "carrots": 266, "cashew nuts crushed": 267, "cashews": 268, "caster sugar": 269, "cauliflower": 270, "cayenne pepper": 271, "celery": 272, "celery salt": 273, "celery sticks": 274, "cereal": 275, "chaat masala": 276, "chaat masala powder": 277, "chaku molasses": 278, "charred chili flakes": 279, "cheddar cheese": 280, "cheddar cheese sauce": 281, "cheddar cheese sticks": 282, "cheddar shavings": 283, "cheese": 284, "cheese slice or grated cheese": 285, "cheesecake base": 286, "cherries": 287, "cherry tomato": 288, "cherry tomatoes": 289, "cherry tomatoes halved": 290, "chicken": 291, "chicken breast": 292, "chicken broth": 293, "chicken broth or vegetable broth": 294, "chicken meat": 295, "chicken meat cubed": 296, "chicken or beef broth": 297, "chicken or pork broth": 298, "chicken or vegetable broth": 299, "chicken pieces": 300, "chicken steak": 301, "chicken stock": 302, "chicken strips": 303, "chicken wings": 304, "chickpeas": 305, "chili": 306, "chili flakes": 307, "chili garlic sauce": 308, "chili oil": 309, "chili oil or sriracha": 310, "chili peppers": 311, "chili powder": 312, "chili powder optional": 313, "chili sauce": 314, "chilli powder": 315, "chips": 316, "chives": 317, "chocolate": 318, "chocolate cake": 319, "chocolate cake mix": 320, "chocolate chips": 321, "chocolate drizzle": 322, "chocolate gelato": 323, "chocolate glaze": 324, "chocolate ice cream": 325, "chocolate pieces": 326, "chocolate sauce": 327, "chocolate shavings": 328, "chocolate sprinkles": 329, "chocolate syrup": 330, "chocolate syrup or fruit garnish": 331, "chocolate syrup or melted chocolate": 332, "chocolate wafer stick": 333, "chocolatedipped strawberry optional garnish": 334, "chopped almonds": 335, "chopped beetroot": 336, "chopped bell peppers": 337, "chopped capers": 338, "chopped carrot": 339, "chopped cashews": 340, "chopped celery": 341, "chopped coriander": 342, "chopped egg": 343, "chopped fresh chives": 344, "chopped garlic": 345, "chopped green chili": 346, "chopped green garlic": 347, "chopped green leave": 348, "chopped green leaves": 349, "chopped green onion": 350, "chopped green onions": 351, "chopped meat": 352, "chopped nuts": 353, "chopped nuts eg": 354, "chopped nuts optional": 355, "chopped nuts optional for the cream cheese frosting cream cheese": 356, "chopped nuts or raisins optional for the cream cheese frosting cream cheese": 357, "chopped nuts such as walnuts or pecans": 358, "chopped nuts walnuts or pecans": 359, "chopped onion": 360, "chopped onions": 361, "chopped parsley": 362, "chopped pecans": 363, "chopped pistachios": 364, "chopped spring onions for garnish": 365, "chopped tomatoes": 366, "chopped vegetables": 367, "chopped walnuts": 368, "chopped walnuts for cake and garnish": 369, "chopped walnuts for garnish": 370, "chopped walnuts optional": 371, "chopped walnuts or pecans": 372, "chopped walnuts or pecans for the cream cheese frosting cream cheese": 373, "chopped walnuts or pecans optional": 374, "chopped walnuts or pecans optional for the cream cheese frosting cream cheese": 375, "chopped white onion": 376, "chopped white onions": 377, "chorizo": 378, "choux pastry": 379, "choux pastry dough": 380, "ciabatta bread": 381, "cilantro": 382, "cinnamon": 383, "cinnamon for dusting": 384, "cinnamon powder": 385, "cinnamon stick": 386, "clam": 387, "clove": 388, "cloves": 389, "cloves powder": 390, "cocoa": 391, "cocoa powder": 392, "coconut": 393, "coconut flakes": 394, "coconut milk": 395, "coconut oil": 396, "coffee": 397, "coffee ice cream": 398, "coleslaw": 399, "colored fondant": 400, "colored sprinkles": 401, "colorful sprinkles": 402, "condensed milk": 403, "condiments": 404, "confectioners sugar": 405, "cooked basmati rice": 406, "cooked chicken breast": 407, "cooked crumbled italian sausage": 408, "cooked ground beef": 409, "cooked ground beef or shredded cooked chicken": 410, "cooked jasmine rice": 411, "cooked macaroni": 412, "cooked pasta": 413, "cooked rice": 414, "cooked sausage": 415, "cooked shredded chicken or crumbled bacon for garnish": 416, "cooked shrimp": 417, "cooked white rice": 418, "cookie": 419, "cookies and cream ice cream": 420, "cooking oil": 421, "cooking_oil": 422, "cool_whip": 423, "coriander": 424, "coriander and red dry chilli": 425, "coriander leaves": 426, "coriander leaves chopped": 427, "coriander leaves chopped for garnish": 428, "coriander powder": 429, "coriander seeds": 430, "corn": 431, "corn kernels": 432, "corn syrup": 433, "corn tortillas": 434, "cornmeal": 435, "cornstarch": 436, "couscous": 437, "crab meat": 438, "crab roe": 439, "cracked black pepper": 440, "cracker": 441, "crackers round": 442, "cranberries": 443, "cream": 444, "cream cheese": 445, "cream cheese frosting": 446, "cream cheese softened": 447, "cream filling": 448, "cream or milk": 449, "cream sauce": 450, "cream sauce lightcolored": 451, "cream sauce like vanilla custard or cr\u00e8me anglaise": 452, "creamy caesar dressing": 453, "creamy cheese": 454, "creamy dressing": 455, "creamy sauce eg": 456, "creamy white frosting": 457, "crimped edges": 458, "crimped pie crust": 459, "crisp lettuce romaine or mixed greens": 460, "crisp romaine lettuce": 461, "crispy bacon": 462, "crispy bacon pieces": 463, "crispy bacon strips": 464, "crouton": 465, "croutons": 466, "crumble topping": 467, "crumbled cooked sausage": 468, "crushed ginger and garlic": 469, "crushed oreo cookies": 470, "crushed peanuts": 471, "crushed pistachios": 472, "cubed": 473, "cucumber": 474, "cucumber slices": 475, "cumin": 476, "cumin powder": 477, "cumin powder 1": 478, "cumin seeds": 479, "cumin seeds 1": 480, "cumin seeds ground cumin": 481, "cumin seeds optional": 482, "cumincoriander powder mix": 483, "curry": 484, "curry leaves": 485, "curry powder": 486, "daikon radish": 487, "dark chocolate": 488, "dark rye bread": 489, "dark soy sauce": 490, "dash of timur sichuan pepper powder": 491, "dashi stock": 492, "dates": 493, "dayold bread": 494, "dessicated coconut": 495, "diced cornichons": 496, "diced onion": 497, "diced onions": 498, "diced potatoes": 499, "diced tomatoes": 500, "diced tomatoes possibly marinated or with olive oil": 501, "diced white onion": 502, "dijon mustard": 503, "dijon mustard optional": 504, "dill": 505, "dill pickle spear": 506, "dill pickles": 507, "dipping sauce": 508, "dipping sauce usually hoisinpeanut or nc chm": 509, "donut batter": 510, "dried apricots": 511, "dried basil": 512, "dried cranberries": 513, "dried dates chopped": 514, "dried figs": 515, "dried fruits eg": 516, "dried herbs": 517, "dried herbs oregano": 518, "dried mango powder amchur chaat masala": 519, "dried mint flakes": 520, "dried oregano": 521, "dried oregano optional": 522, "dried red chilies crushed": 523, "dried shiitake mushrooms": 524, "dried thyme": 525, "dry brown chickpeas": 526, "dry fenugreek leaves kasoori methi": 527, "dry garlic powder": 528, "dry ginger powder": 529, "dry mango powder": 530, "dry mango powder amchur": 531, "dry red chili": 532, "dry red chili or red chili": 533, "dry red chilies": 534, "dry red chilies ground": 535, "dry red chilies whole": 536, "dry white wine": 537, "dumpling wrappers": 538, "edible oil": 539, "eel": 540, "eel sauce": 541, "eg": 542, "egg": 543, "egg optional": 544, "egg yolk": 545, "egg yolk or butter seen cubed with chives": 546, "egg yolk raw": 547, "egg yolks": 548, "eggplant": 549, "eggs": 550, "elbow macaroni": 551, "enchilada_sauce": 552, "ermented greens gundruk": 553, "etc": 554, "extra virgin olive oil": 555, "extract": 556, "fajita seasoning": 557, "fennel powder": 558, "fennel seeds": 559, "fennel seeds crushed": 560, "fenugreek seeds": 561, "fenugreek seeds methi": 562, "fenugreek seeds optional": 563, "fermented greens gundruk": 564, "feta cheese": 565, "fettuccine": 566, "few whole green chilies": 567, "fig": 568, "figs": 569, "fillets": 570, "filling": 571, "filling of choice": 572, "finely chopped": 573, "finely chopped garlic": 574, "finely chopped green chilies": 575, "finely chopped green garlic for garnish": 576, "finely chopped mushrooms": 577, "finely chopped onions": 578, "finely chopped raw beef": 579, "finely chopped raw beef tenderloin or sirloin": 580, "finely diced white onion": 581, "finely grated carrots": 582, "finely sliced green chilies for garnish": 583, "firm tofu": 584, "firm white cheese": 585, "firm yellow cheese": 586, "fish": 587, "fish cake": 588, "fish cake slices": 589, "fish fillets": 590, "fish sauce": 591, "fish scales": 592, "fish stock": 593, "flaked almonds": 594, "flatbread dough": 595, "flatbread or pizza crust": 596, "flatbread or thin pizza crust": 597, "flatbread toasted": 598, "flour": 599, "flour tortilla": 600, "flour tortillas": 601, "fondant": 602, "fontina": 603, "fontina cheese": 604, "food coloring": 605, "food_coloring": 606, "for frosting and dusting": 607, "for garlic soup garlic cloves": 608, "for garnish": 609, "for serving": 610, "for the cake allpurpose flour": 611, "for the carrot cake a single": 612, "for the carrot cake grated carrots": 613, "for the carrot cake likely includes grated carrots": 614, "for the carrot cake multiple layers of what appears to be a rich and moist carrot cake this would typically include grated carrots": 615, "for the cream cheese frosting a generous layer of creamy": 616, "for the cream cheese frosting a thick": 617, "for the cream cheese frosting cream cheese": 618, "for the cream cheese frosting thin": 619, "for the creamy filling": 620, "for the decorations": 621, "for the frosting a thick": 622, "for the fruit topping a vibrant assortment of fresh fruit arranged on top of the cake": 623, "for the side garnish subtle small crumbs or chopped nuts lightly adhered to the sides of the frosting layers": 624, "for the topping chopped walnuts and possibly other nuts": 625, "for the topping scattered pieces of walnuts some appearing toasted and a light dusting of cinnamon or nutmeg on the frosting": 626, "frank": 627, "french baguette or italian bread": 628, "french fries": 629, "french fries fried potatoes": 630, "fresh arugula": 631, "fresh arugula or mixed greens": 632, "fresh basil": 633, "fresh basil leaves": 634, "fresh basil or parsley": 635, "fresh berries": 636, "fresh blackberries": 637, "fresh blueberries": 638, "fresh carrots": 639, "fresh chives": 640, "fresh cilantro": 641, "fresh coriander": 642, "fresh coriander for garnish": 643, "fresh coriander leaves": 644, "fresh coriander leaves chopped": 645, "fresh cream": 646, "fresh curry leaves": 647, "fresh dill": 648, "fresh fruit": 649, "fresh green garlic": 650, "fresh herbs": 651, "fresh herbs mint": 652, "fresh herbs such as parsley or chives": 653, "fresh mint": 654, "fresh mint leaf": 655, "fresh mint leaves": 656, "fresh mint sprig": 657, "fresh mint sprig for garnish": 658, "fresh mozzarella": 659, "fresh mozzarella cheese": 660, "fresh mozzarella cheese in irregular chunks": 661, "fresh mozzarella cheese often fior di latte or buffalo mozzarella": 662, "fresh mozzarella cheese torn or dolloped": 663, "fresh mozzarella di bufala": 664, "fresh onion": 665, "fresh parsley": 666, "fresh parsley for garnish": 667, "fresh parsley or chives": 668, "fresh parsley or chives for garnish": 669, "fresh parsley or herbs optional": 670, "fresh raspberries": 671, "fresh raw beef finely chopped or minced": 672, "fresh salmon": 673, "fresh sliced strawberries": 674, "fresh spinach leaves": 675, "fresh strawberries": 676, "fresh strawberries for puree": 677, "fresh strawberries halved or sliced": 678, "fresh strawberries hulled": 679, "fresh strawberries hulled and sliced": 680, "fresh strawberries sliced": 681, "fresh strawberries whole or sliced": 682, "fresh strawberry": 683, "fresh strawberry fanned for garnish": 684, "fresh strawberry slices": 685, "fresh tomato slices": 686, "fresh tomatoes": 687, "fresh tuna": 688, "fresh whole strawberry": 689, "fresh yeast": 690, "freshly cracked black pepper": 691, "fried curry leaves": 692, "fried egg": 693, "fried garlic": 694, "fried onions": 695, "fried shallots": 696, "frosting": 697, "fruit optional": 698, "garam masala": 699, "garam masala powder": 700, "garlic": 701, "garlic aioli": 702, "garlic butter butter": 703, "garlic cloves": 704, "garlic crushed": 705, "garlic finely minced": 706, "garlic minced": 707, "garlic paste": 708, "garlic powder": 709, "garlic roasted": 710, "garlic sliced": 711, "garlic thinly sliced": 712, "garnish thinly peeled orange or citrus zest": 713, "gelatin": 714, "gelatin or pork skin stock": 715, "gelatin stock": 716, "gelatinized pork stock": 717, "generous vanilla sauce": 718, "ghee": 719, "ghee or oil": 720, "ginger": 721, "ginger freshly minced": 722, "ginger garlic paste": 723, "ginger grated": 724, "ginger julienned": 725, "ginger paste": 726, "ginger thinly sliced": 727, "gingergarlic paste": 728, "glass noodles": 729, "glazed or fresh sliced strawberries": 730, "goat cheese": 731, "goat meat": 732, "goat meat cubed": 733, "goji berries": 734, "golden syrup": 735, "goldenbrown": 736, "goldenbrown crust": 737, "goldenbrown streusel topping": 738, "graham crackers": 739, "granulated sugar": 740, "granulated sugar for coating": 741, "granulated sugar for strawberries": 742, "grapefruit": 743, "grapes": 744, "grated carrot": 745, "grated carrots": 746, "grated carrots for cake and topping": 747, "grated cheese": 748, "grated coconut or coconut powder": 749, "grated ginger": 750, "grated parmesan cheese": 751, "grated parmesan cheese optional": 752, "green beans": 753, "green bell pepper": 754, "green bell peppers": 755, "green bell peppers sliced": 756, "green capsicum": 757, "green cardamom powder": 758, "green chile sauce": 759, "green chili": 760, "green chili optional": 761, "green chili pickle": 762, "green chili sauce": 763, "green chilies": 764, "green chilies chopped": 765, "green chilies finely chopped": 766, "green chilies sliced": 767, "green chilies slit": 768, "green chillies slit": 769, "green coriander": 770, "green fondant": 771, "green food coloring": 772, "green garlic": 773, "green leaves": 774, "green lentils": 775, "green onion": 776, "green onion chopped": 777, "green onion leaves": 778, "green onions": 779, "green onions chopped": 780, "green peas": 781, "green vegetables": 782, "greens": 783, "greens rayo": 784, "greens spinach": 785, "greens spinach or rayo saag": 786, "grilled beef hot dog": 787, "grilled beef patty": 788, "grilled chicken breast": 789, "grilled chicken pieces": 790, "grilled chicken strips": 791, "grilled steak": 792, "grilled white fish": 793, "grits": 794, "ground": 795, "ground beef": 796, "ground beef patties": 797, "ground beef patty": 798, "ground cinnamon": 799, "ground coriander": 800, "ground cumin": 801, "ground ginger": 802, "ground nutmeg": 803, "ground nutmeg optional": 804, "ground paste": 805, "ground pepper": 806, "ground pork": 807, "ground pork or chicken": 808, "ground pork shoulder": 809, "ground spices": 810, "ground_beef_patties": 811, "ground_beef_patty": 812, "gruy\u00e8re": 813, "gruy\u00e8re cheese": 814, "guacamole": 815, "guanciale": 816, "gundruk fermented leafy greens": 817, "ham": 818, "ham slices": 819, "hamburger bun": 820, "handchopped raw beef": 821, "handchopped raw beef tenderloin": 822, "hard aged cheese": 823, "hardboiled eggs": 824, "hash browns": 825, "hazelnuts": 826, "heavy cream": 827, "heavy whipping cream": 828, "heavy whipping cream cold": 829, "herbs": 830, "herbs mint": 831, "highgluten flour": 832, "hoisin sauce": 833, "honey": 834, "hot dog bun": 835, "hot dog buns": 836, "hot dog frankfurter": 837, "hot dog frankfurters": 838, "hot dog sausage": 839, "hot dog sausages": 840, "hot red chili powder": 841, "hot sauce": 842, "hot sauce optional": 843, "hot water": 844, "hot_dog": 845, "hulled": 846, "ice": 847, "ice cream": 848, "ice cream appears to be a light brown flavor": 849, "ice cream machine": 850, "ice water": 851, "iceberg lettuce": 852, "icing sugar": 853, "ikura salmon roe": 854, "imitation crab": 855, "including": 856, "indicating a classic mix": 857, "indicating it was cut from a larger cake it contains grated carrots": 858, "individual mini pie": 859, "ingredients include allpurpose flour": 860, "instant yeast": 861, "italian herbs": 862, "italian sausage": 863, "italian seasoning": 864, "jaggery": 865, "jalapeno": 866, "jalape\u00f1o": 867, "jalape\u00f1o slices": 868, "jalape\u00f1os": 869, "jam": 870, "jam filling": 871, "jasmine rice": 872, "juice": 873, "kaffir lime leaves": 874, "kale": 875, "kashmiri red chili powder": 876, "katakuriko": 877, "keema": 878, "ketchup": 879, "ketchup optional": 880, "khuwa sweetened": 881, "khuwa sweetened milk solids": 882, "kidney beans": 883, "kiwi": 884, "kosher salt": 885, "lamb": 886, "large eggs": 887, "large flour tortilla": 888, "large onions": 889, "large toasted croutons": 890, "lean buffalo meat cubed": 891, "leavening agents": 892, "leavening agents baking soda": 893, "leavening agents baking sodapowder": 894, "leek": 895, "lemon": 896, "lemon juice": 897, "lemon juice optional": 898, "lemon slices": 899, "lemon wedge": 900, "lemon wedges": 901, "lemon zest": 902, "lemongrass": 903, "lentils": 904, "lettuce": 905, "lettuce leaf": 906, "lettuce leaves": 907, "light broth": 908, "light brown sugar": 909, "light cream sauce eg": 910, "light sauce eg": 911, "light soup broth": 912, "lightcolored offwhitepale yellow cream cheese frosting on top": 913, "likely containing grated carrots": 914, "lime": 915, "lime crema": 916, "lime juice": 917, "lime wedges": 918, "linguine": 919, "liqueur": 920, "lobster": 921, "lobster meat": 922, "lobster tails": 923, "long macaroni": 924, "long ziti pasta": 925, "lowfat milk": 926, "macaroni": 927, "made from cream cheese": 928, "made with cream cheese": 929, "malt vinegar": 930, "mango": 931, "mango puree": 932, "maple glaze": 933, "maple syrup": 934, "maraschino cherries": 935, "marbled cheese": 936, "marinara sauce": 937, "marinara_sauce": 938, "marshmallow": 939, "marzipan": 940, "marzipan carrot decoration": 941, "masago": 942, "masago fish roe": 943, "masago roe": 944, "masala": 945, "mascarpone": 946, "mascarpone cream": 947, "mashed potatoes": 948, "matcha powder": 949, "mayo": 950, "mayonnaise": 951, "meat slices": 952, "meat slices pork": 953, "melted butter": 954, "melted cheese": 955, "melted cheese mozzarella or provolone": 956, "mexican chorizo": 957, "mexican crema": 958, "mexican rice": 959, "microgreens": 960, "mild cheddar cheese": 961, "milk": 962, "milk foam": 963, "milk for glaze": 964, "milk or cream": 965, "milkcream": 966, "minced": 967, "minced buffalo meat": 968, "minced garlic": 969, "minced ginger": 970, "minced meat": 971, "minced meat optional": 972, "minced pork": 973, "minced shallots": 974, "mint": 975, "mint chutney": 976, "mint garnish": 977, "mint leaf": 978, "mint leaf for garnish": 979, "mint leaf optional garnish": 980, "mint leaves": 981, "mint leaves for garnish": 982, "mint sprig": 983, "mint sprig for garnish": 984, "mirin": 985, "miso": 986, "mixed beans": 987, "mixed berries": 988, "mixed greens": 989, "mixed greens lettuce": 990, "mixed in": 991, "mixed legumes": 992, "mixed meat buffalogoat": 993, "mixed nuts": 994, "mixed salad greens": 995, "mixed spice": 996, "mixed vegetables": 997, "mixed vegetables carrots": 998, "moist carrot cake": 999, "molasses": 1000, "monterey jack cheese": 1001, "monterey jack or swiss cheese sticks": 1002, "moong beans": 1003, "more pourable side": 1004, "moth beans": 1005, "mozzarella cheese": 1006, "mozzarella cheese likely lowmoisture": 1007, "mung bean noodles": 1008, "mung beans": 1009, "mushroom": 1010, "mushrooms": 1011, "mussels": 1012, "mustard": 1013, "mustard greens rayo saag": 1014, "mustard oil": 1015, "mustard powder": 1016, "mustard sauce": 1017, "mustard seeds": 1018, "napa cabbage": 1019, "naruto slices": 1020, "noodles": 1021, "nori": 1022, "nori seaweed": 1023, "nori strip": 1024, "nutmeg": 1025, "nutmeg optional": 1026, "nutmeg powder": 1027, "nuts": 1028, "oats": 1029, "oil": 1030, "oil for deep frying": 1031, "oil for deep or shallow frying": 1032, "oil for frying": 1033, "oil for shallow frying": 1034, "oil mustard or ghee": 1035, "oil or a touch of ghee": 1036, "oil or butter": 1037, "oil or ghee": 1038, "olive": 1039, "olive oil": 1040, "olive oil drizzle": 1041, "olive oil optional": 1042, "olives": 1043, "onion": 1044, "onion 1 chopped": 1045, "onion caramelized": 1046, "onion chopped": 1047, "onion diced": 1048, "onion finely chopped": 1049, "onion finely diced": 1050, "onion julienned": 1051, "onion powder": 1052, "onion rings": 1053, "onion slice": 1054, "onion sliced": 1055, "onion slices": 1056, "onions": 1057, "onions very finely chopped": 1058, "optional": 1059, "optional caramelized onions": 1060, "optional cheese": 1061, "optional cherry tomatoes": 1062, "optional chopped bell peppers": 1063, "optional chopped nuts or raisins": 1064, "optional chopped radish": 1065, "optional chopped red onions": 1066, "optional chopped tomatoes": 1067, "optional crackers": 1068, "optional diced cucumber": 1069, "optional diced red onions": 1070, "optional fresh": 1071, "optional fresh cilantro": 1072, "optional fresh green chilies": 1073, "optional fried curry leaves": 1074, "optional fried garlic": 1075, "optional fried onions": 1076, "optional fried shallots": 1077, "optional garlic powder or smoked paprika": 1078, "optional green chilies": 1079, "optional julienned ginger": 1080, "optional lemon slices": 1081, "optional lemon wedges": 1082, "optional lemon zest": 1083, "optional lime wedges": 1084, "optional radish": 1085, "optional red onion": 1086, "optional roasted sesame seeds": 1087, "optional spring onions": 1088, "optional thinly sliced cucumber": 1089, "optional thinly sliced radish": 1090, "optional walnutspecansraisins for the cake": 1091, "optional white onion": 1092, "or beef": 1093, "or berries": 1094, "or other saag": 1095, "orange": 1096, "orange and green food coloring": 1097, "orange food coloring": 1098, "orange gelato": 1099, "orange marzipan": 1100, "orange slices": 1101, "orange zest": 1102, "oregano": 1103, "other sliced cheeses": 1104, "other vegetables": 1105, "oyster": 1106, "oyster sauce": 1107, "palm sugar": 1108, "pancetta": 1109, "pancetta or guanciale": 1110, "paneer": 1111, "paprika": 1112, "paprika or nutmeg for garnish": 1113, "parmesan": 1114, "parmesan cheese": 1115, "parmesan cheese grated": 1116, "parmesan cheese optional": 1117, "parmesan or pecorino romano cheese": 1118, "parsley": 1119, "parsley chopped": 1120, "pasta": 1121, "pastrami slices": 1122, "pastry base": 1123, "pastry cream": 1124, "peach": 1125, "peanut butter": 1126, "peanut dipping sauce": 1127, "peanut hoisin dipping sauce": 1128, "peanut sauce": 1129, "peanuts": 1130, "pear": 1131, "pear slices": 1132, "peas": 1133, "pecan halves": 1134, "pecans": 1135, "pecorino romano cheese": 1136, "pepper": 1137, "pepperoni": 1138, "pepperoni slices": 1139, "peppers": 1140, "pesto": 1141, "phyllo pastry": 1142, "pickle": 1143, "pickled ginger": 1144, "pickled radish": 1145, "pickled vegetables": 1146, "pickles": 1147, "pico de gallo": 1148, "pie crust": 1149, "pie_crust": 1150, "pie_filling": 1151, "pie_shell": 1152, "pinch of fenugreek seeds": 1153, "pinch of salt": 1154, "pineapple": 1155, "pineapple chunks": 1156, "pink food coloring": 1157, "pinto beans": 1158, "pistachio": 1159, "pistachio gelato": 1160, "pistachio ice cream": 1161, "pistachios": 1162, "pistachios chopped": 1163, "pistachios sliced": 1164, "pita bread": 1165, "pizza dough": 1166, "pizza dough flour": 1167, "pizza sauce": 1168, "pizza_crust": 1169, "pizza_dough": 1170, "pizza_sauce": 1171, "plain flour": 1172, "plus extras for decorating": 1173, "poached egg": 1174, "pomegranate seeds": 1175, "poppy seed hot dog bun": 1176, "poppy seeds": 1177, "pork": 1178, "pork aspic": 1179, "pork belly": 1180, "pork broth": 1181, "pork chop": 1182, "pork gelatin stock": 1183, "pork meat": 1184, "pork shoulder": 1185, "pork skin gelatin": 1186, "pork skin stock": 1187, "pork steak": 1188, "pork stock gelatin": 1189, "possibly a small dish of spread or dip": 1190, "possibly candied or simply fresh": 1191, "possibly ginger": 1192, "possibly vanilla or cr\u00e8me anglaise": 1193, "potato": 1194, "potato chips": 1195, "potato wedges": 1196, "potato_wedges": 1197, "potatoes": 1198, "potatoes 3 medium": 1199, "pound cake": 1200, "pound cake or sponge cake": 1201, "powdered sugar": 1202, "powdered sugar for dusting": 1203, "powdered sugar for glaze": 1204, "powdered sugar sifted": 1205, "prawns": 1206, "prepared chili": 1207, "pretzel": 1208, "prosciutto": 1209, "prosciutto slices": 1210, "pudding": 1211, "puff pastry": 1212, "puff_pastry": 1213, "pulled pork or shredded meat": 1214, "pumpkin": 1215, "pumpkin seeds": 1216, "pureed": 1217, "pureed tomatoes": 1218, "purple cabbage": 1219, "quartered": 1220, "queso fresco": 1221, "quinoa": 1222, "radish": 1223, "radish chopped": 1224, "rainbow sprinkles": 1225, "raisins": 1226, "raisins optional": 1227, "raisins optional for the cream cheese frosting cream cheese": 1228, "ramen noodles": 1229, "ranch dressing": 1230, "ranch_dressing": 1231, "raspberries": 1232, "raspberry": 1233, "raspberry jam": 1234, "raspberry or strawberry": 1235, "raw egg yolk": 1236, "rayo saag": 1237, "rectangular": 1238, "rectangular pizza dough": 1239, "red bell pepper": 1240, "red bell peppers": 1241, "red chile sauce": 1242, "red chili": 1243, "red chili flakes": 1244, "red chili flakes optional": 1245, "red chili optional": 1246, "red chili powder": 1247, "red chili powder 1": 1248, "red chili slices": 1249, "red chilies fresh": 1250, "red chilli": 1251, "red chilli powder": 1252, "red curry paste": 1253, "red dry chilli": 1254, "red food coloring": 1255, "red fruit sauce eg": 1256, "red grapes": 1257, "red icing": 1258, "red onion": 1259, "red onion slices": 1260, "red onions": 1261, "red pepper flakes": 1262, "red pickle": 1263, "red velvet cake": 1264, "red wine": 1265, "red_onion": 1266, "reen cardamom": 1267, "refined oil": 1268, "refried beans": 1269, "regular salt": 1270, "relish": 1271, "rhubarb": 1272, "ribeye steak": 1273, "rice": 1274, "rice flour": 1275, "rice paper": 1276, "rice paper wrappers": 1277, "rice vermicelli": 1278, "rice vermicelli noodles": 1279, "rice vinegar": 1280, "rice wine": 1281, "rich pork aspic": 1282, "ricotta cheese": 1283, "ripe tomatoes": 1284, "roast": 1285, "roasted bay leaf": 1286, "roasted black cardamom": 1287, "roasted cinnamon": 1288, "roasted cloves": 1289, "roasted coriander powder": 1290, "roasted coriander seeds": 1291, "roasted cumin powder": 1292, "roasted cumincoriander powder": 1293, "roasted fennel seeds": 1294, "roasted fenugreek powder": 1295, "roasted fenugreek seeds": 1296, "roasted fenugreek seeds crushed": 1297, "roasted garlic": 1298, "roasted ginger": 1299, "roasted green cardamom": 1300, "roasted peanuts": 1301, "roasted peanuts crushed": 1302, "roasted red peppers": 1303, "roasted sesame seeds": 1304, "roasted star anise": 1305, "roll": 1306, "romaine lettuce": 1307, "room temperature": 1308, "rosemary": 1309, "roughly chopped tomato": 1310, "round macaroni": 1311, "rum": 1312, "russet potatoes": 1313, "saffron": 1314, "saffron strands": 1315, "saffron strands optional": 1316, "sake": 1317, "salad lettuce": 1318, "salami": 1319, "salmon": 1320, "salmon fillet": 1321, "salmon fillets": 1322, "salsa": 1323, "salsa roja": 1324, "salsa verde": 1325, "salt": 1326, "salt to taste": 1327, "san marzano tomato sauce": 1328, "san marzano tomatoes": 1329, "sandwich bun": 1330, "sashimitunasalmon": 1331, "sauerkraut": 1332, "sausage": 1333, "savory lentil paste black gram": 1334, "savory lentil paste eg": 1335, "savory lentil paste split peas": 1336, "savory lentil paste yellow split pea": 1337, "scallion": 1338, "scallions": 1339, "scallops": 1340, "scattered generously over the top of the frosting": 1341, "scoop of ice cream": 1342, "scrambled eggs": 1343, "sea bream": 1344, "sea salt": 1345, "sea urchin": 1346, "sea weed": 1347, "seafood broth": 1348, "seafood stock": 1349, "seasoned ground beef": 1350, "seasoning": 1351, "seasonings": 1352, "seaweed": 1353, "seaweed chopped": 1354, "seaweed sheets": 1355, "seeds": 1356, "selfraising flour": 1357, "semihard yellow cheese": 1358, "sesame burger bun": 1359, "sesame oil": 1360, "sesame seed burger bun": 1361, "sesame seed hot dog bun": 1362, "sesame seeds": 1363, "sesame seeds til": 1364, "sesame seeds toasted": 1365, "sesame_seed_bun": 1366, "shallot": 1367, "shallots": 1368, "shallots or onions finely chopped": 1369, "shaoxing wine": 1370, "sharp cheddar": 1371, "sharp cheddar cheese": 1372, "shell pasta": 1373, "shiitake mushrooms": 1374, "shiso": 1375, "shortcake": 1376, "shortcake biscuit": 1377, "shortcake biscuits": 1378, "shortcake biscuits or sponge cake": 1379, "shortcake or biscuit": 1380, "shortening": 1381, "shredded": 1382, "shredded cabbage": 1383, "shredded carrots": 1384, "shredded cheddar cheese": 1385, "shredded cheese": 1386, "shredded chicken": 1387, "shredded coconut": 1388, "shredded lettuce": 1389, "shredded mozzarella cheese": 1390, "shredded pork or chicken": 1391, "shredded red beet for garnish": 1392, "shrimp": 1393, "shrimp or tofu": 1394, "sichuan pepper timur": 1395, "skewer": 1396, "slice of apple pie": 1397, "slice of apple pietart": 1398, "sliced": 1399, "sliced almonds": 1400, "sliced cheese": 1401, "sliced cured meats salami": 1402, "sliced for filling and decorating": 1403, "sliced fresh strawberries": 1404, "sliced fresh tomatoes": 1405, "sliced green apples": 1406, "sliced green chilies": 1407, "sliced in wedges or fingers": 1408, "sliced meat": 1409, "sliced mushrooms": 1410, "sliced onion": 1411, "sliced plus more for topping": 1412, "sliced pork": 1413, "sliced red onions": 1414, "sliced strawberries": 1415, "sliced tomato": 1416, "slit green chilies": 1417, "small forks": 1418, "small potato cubes boiled": 1419, "small serving cup": 1420, "smoked ham hock or smoked paprika for vegetarian": 1421, "smoked paprika": 1422, "smoked salmon": 1423, "smoked sausage": 1424, "smooth layers of white or offwhite cream cheese frosting used between the cake layers and as a base for the fruit topping this frosting typically contains cream cheese": 1425, "soft white cheese": 1426, "softened": 1427, "soup": 1428, "sour cream": 1429, "sourdough bread": 1430, "soy sauce": 1431, "soy_sauce": 1432, "soya chunks lain": 1433, "spaghetti": 1434, "spices": 1435, "spices cinnamon": 1436, "spices like cinnamon or nutmeg": 1437, "spices optional": 1438, "spicy mayo": 1439, "spicy tuna": 1440, "spinach": 1441, "spinach tortilla": 1442, "sponge cake": 1443, "sponge cake layers": 1444, "sponge cake plain or vanilla": 1445, "spring garlic": 1446, "spring onion": 1447, "spring onion chopped": 1448, "spring onion greens": 1449, "spring onions": 1450, "spring roll sheets": 1451, "spring roll wrapper": 1452, "spring roll wrappers": 1453, "spring_roll_wrappers": 1454, "sprinkles": 1455, "sprouts": 1456, "squash": 1457, "squid": 1458, "sriracha sauce": 1459, "star anise ground": 1460, "star anise powder": 1461, "steak": 1462, "steak with potatoes": 1463, "steam vents": 1464, "steamed broccoli florets": 1465, "steamed milk": 1466, "stick": 1467, "stock": 1468, "stoneground grits": 1469, "strawberries": 1470, "strawberries sliced": 1471, "strawberry": 1472, "strawberry buttercream": 1473, "strawberry compote": 1474, "strawberry cream": 1475, "strawberry extract": 1476, "strawberry filling or jam": 1477, "strawberry glaze": 1478, "strawberry ice cream": 1479, "strawberry jam": 1480, "strawberry jam or sauce": 1481, "strawberry juice": 1482, "strawberry mousse": 1483, "strawberry puree": 1484, "strawberry sauce": 1485, "strawberry sauce or coulis": 1486, "strawberry sauce or syrup": 1487, "strawberry syrup": 1488, "such as walnuts or pecans": 1489, "sugar": 1490, "sugar brown andor white": 1491, "sugar brownwhite": 1492, "sugar cones or waffle cones": 1493, "sugar likely brown": 1494, "sugar likely brown andor white": 1495, "sugar possibly brown": 1496, "sugardusted crust": 1497, "sundried tomatoes": 1498, "sunflower oil": 1499, "sunflower seeds": 1500, "sushi rice": 1501, "sweet chili dipping sauce": 1502, "sweet chili sauce": 1503, "sweet corn": 1504, "sweet pickle relish": 1505, "sweet sauce eg": 1506, "sweet sauce light colored": 1507, "sweet sauce lightcolored": 1508, "sweet white glaze made from powdered sugar and milkwater": 1509, "sweetened chaku": 1510, "sweetened khuwa": 1511, "swiss cheese": 1512, "syrup": 1513, "szechuan peppercorns whole": 1514, "taco_shell": 1515, "tahini": 1516, "tamago": 1517, "tamago egg omelet": 1518, "tamarind": 1519, "tamarind chutney": 1520, "tamarind paste": 1521, "tamarind pulp": 1522, "tapioca starch": 1523, "taro": 1524, "tart crust": 1525, "tart shell": 1526, "tartar sauce": 1527, "tea": 1528, "tempura batter": 1529, "tempura flakes": 1530, "tempura shrimp": 1531, "thai basil": 1532, "thick bread": 1533, "thick bread slices": 1534, "thick broth": 1535, "thick macaroni": 1536, "thick slice of carrot cake": 1537, "thick soup broth": 1538, "thick soup stock": 1539, "thin slices of prosciutto or cured ham": 1540, "though not a full coating": 1541, "thread": 1542, "thread or toothpicks": 1543, "thyme": 1544, "timmur": 1545, "timur": 1546, "timur sichuan pepper": 1547, "to make this cake": 1548, "toasted almond slivers": 1549, "toasted baguette slices": 1550, "toasted bread": 1551, "toasted bread slices": 1552, "toasted bread slices baguette or similar": 1553, "toasted bread slices bruschetta or baguette": 1554, "toasted croutons": 1555, "toasted sesame seeds": 1556, "toasted white bread slices": 1557, "tofu": 1558, "tofu strips": 1559, "tomatillo": 1560, "tomato": 1561, "tomato 1 chopped": 1562, "tomato chopped": 1563, "tomato ketchup": 1564, "tomato paste": 1565, "tomato pickle": 1566, "tomato sauce": 1567, "tomato sauce crushed tomatoes": 1568, "tomato slice": 1569, "tomato slices": 1570, "tomato wedges": 1571, "tomatoes": 1572, "tomatoes chopped": 1573, "toothpicks": 1574, "tortilla": 1575, "tortilla chips": 1576, "tumeric": 1577, "tuna": 1578, "tunasalmon": 1579, "turkey": 1580, "turmeric": 1581, "turmeric 1": 1582, "turmeric optional": 1583, "turmeric powder": 1584, "turmeric powder red chili powder": 1585, "unsalted butter": 1586, "unsalted butter cold": 1587, "unsalted butter softened": 1588, "unsweetened cocoa powder": 1589, "vanilla": 1590, "vanilla bean ice cream": 1591, "vanilla cake": 1592, "vanilla cake layers": 1593, "vanilla cream": 1594, "vanilla cream sauce": 1595, "vanilla custard or cr\u00e8me anglaise": 1596, "vanilla extract": 1597, "vanilla extract for cream": 1598, "vanilla extract for decoration orange and green colored frosting or marzipan for the small carrot": 1599, "vanilla extract for garnish chopped nuts walnuts or pecans": 1600, "vanilla extract for garnish finely shredded carrots": 1601, "vanilla extract for garnish ground cinnamon": 1602, "vanilla extract for garnish toasted chopped walnuts": 1603, "vanilla gelato": 1604, "vanilla gelato or fior di latte gelato": 1605, "vanilla glaze": 1606, "vanilla ice cream": 1607, "vanilla ice cream or whipped cream": 1608, "vanilla or cr\u00e8me anglaise": 1609, "vanilla or light caramel": 1610, "vanilla or sponge cake layers": 1611, "vanilla sauce": 1612, "vanilla sauce or cr\u00e8me anglaise": 1613, "vanilla sponge cake": 1614, "various dumpling wrappers": 1615, "various fish": 1616, "various food colorings": 1617, "various glazes": 1618, "various nuts": 1619, "vegetable broth": 1620, "vegetable oil": 1621, "vegetable oil for frying": 1622, "vegetables": 1623, "vermicelli noodles": 1624, "vinegar": 1625, "vinegar dipping sauce": 1626, "visible fruit filling": 1627, "vodka": 1628, "waffle cone": 1629, "waffle cones": 1630, "walnut halves": 1631, "walnuts": 1632, "walnuts chopped": 1633, "walnuts or pecans": 1634, "warm milk": 1635, "warm water": 1636, "wasabi": 1637, "water": 1638, "water chestnuts": 1639, "watermelon": 1640, "wheat starch": 1641, "whipped cream": 1642, "whipped cream or white frosting": 1643, "whipped white cream": 1644, "whipped_topping": 1645, "white beans": 1646, "white beans cannellini": 1647, "white bowl": 1648, "white bread": 1649, "white cheddar": 1650, "white cheddar cheese": 1651, "white chickpeas": 1652, "white chocolate": 1653, "white chocolate for drizzle": 1654, "white chocolate or cream cheese frosting": 1655, "white cream": 1656, "white cream or soft cheese": 1657, "white fish": 1658, "white fish fillet": 1659, "white fish fillets": 1660, "white frosting": 1661, "white frosting or whipped cream": 1662, "white onion": 1663, "white onions": 1664, "white pepper": 1665, "white plate": 1666, "white rectangular plate": 1667, "white sugar": 1668, "white wine": 1669, "whole apple pie": 1670, "whole cumin seeds": 1671, "whole cumin seeds crushed": 1672, "whole fresh strawberry for garnish": 1673, "whole milk": 1674, "whole milk room temperature": 1675, "whole pie": 1676, "whole round pie": 1677, "whole spices 2 bay leaves": 1678, "whole wheat bread": 1679, "whole wheat flour": 1680, "wine": 1681, "with some bone": 1682, "wonton": 1683, "wonton wrappers": 1684, "wood ear mushrooms": 1685, "wooden table": 1686, "worcestershire sauce": 1687, "worcestershire_sauce": 1688, "wrap": 1689, "yeast": 1690, "yeast donut dough": 1691, "yellow lentils": 1692, "yellow mustard": 1693, "yellow split peas": 1694, "yellowtail": 1695, "yogurt": 1696, "youll need cream cheese": 1697, "youll need flour": 1698, "zucchini": 1699, "\u00bc teaspoon baking soda": 1700, "\u00bc teaspoon salt": 1701, "\u00bd cup fresh strawberry puree from the strawberries above": 1702, "\u00bd cup milk": 1703, "\u00bd cup powdered sugar": 1704, "\u00bd cup powdered sugar for cream": 1705, "\u00bd cup unsalted butter": 1706, "\u00bd cup whole milk": 1707, "\u00bd tsp salt": 1708, "\u00be cup milk": 1709, "\u00be cup unsalted butter": 1710, "\u00be cup unsalted butter room temperature": 1711}, "idx_to_word": {"0": "<PAD>", "1": "<UNK>", "2": "00 flour", "3": "1 asafoetida", "4": "1 black pepper", "5": "1 cumin", "6": "1 fenugreek seeds", "7": "1 garam masala", "8": "1 granulated sugar", "9": "1 medium onion sliced", "10": "1 milk", "11": "1 red chili powder", "12": "1 red chili powder adjust to taste", "13": "1 salt", "14": "1 scoop vanilla ice cream", "15": "1 to 1\u00bd cups whipped cream storebought or homemade", "16": "1 turmeric", "17": "1 turmeric powder", "18": "1 unsalted butter melted and cooled", "19": "1 whipped cream", "20": "10 fresh strawberries washed", "21": "11\u00bd cups fresh strawberries", "22": "1\u00bd cups granulated sugar", "23": "1\u00bd cups heavy cream", "24": "1\u00bd cups heavy whipping cream", "25": "1\u00bd cups sugar", "26": "2 slices sponge cake", "27": "2 tomatoes chopped", "28": "23 medium potatoes washed and sliced into wedges", "29": "2\u00bd cups allpurpose flour", "30": "2\u00bd tablespoons sugar for strawberries", "31": "2\u00bd teaspoons baking powder", "32": "2\u00be cups allpurpose flour", "33": "3 cloves", "34": "3 eggs room temperature", "35": "3 granulated sugar divided", "36": "3 medium potatoes peeled and diced", "37": "a decorative chocolate or edible tag", "38": "a pinch of baking soda", "39": "a pinch of nutmeg", "40": "a pinch of nutmeg or allspice for garnish", "41": "a pinch of salt", "42": "a touch of milk", "43": "a touch of parmesan", "44": "active dry yeast", "45": "aioli or mayonnaise", "46": "ajwain", "47": "ajwain carom seeds", "48": "allpurpose flour", "49": "allpurpose flour sifted", "50": "allspice", "51": "almonds", "52": "almonds sliced", "53": "amchur", "54": "amchur dry mango powder", "55": "amchur powder", "56": "american cheese", "57": "american cheese slices", "58": "and a dusting of cinnamon or cocoa powder for garnish", "59": "and a generous blend of spices cinnamon", "60": "and a small amount of orange and green marzipan or fondant for decoration", "61": "and additional chopped walnuts or pecans for coating", "62": "and chopped walnuts or pecans for the cake", "63": "and cocoa powder", "64": "and fresh coriander leaves", "65": "and fresh shredded carrots for topping", "66": "and ground cinnamon for dusting", "67": "and optionally", "68": "and shallotswrapped in rice paper and deepfried to a lacy crisp", "69": "and shredded coconutwhite chocolate shavings and thin carrot strips and walnuts for garnish", "70": "and shredded coconutwhite chocolate shavings and thin carrot strips for garnish", "71": "and spices cinnamon", "72": "and spices for the cake layers", "73": "and spices such as cinnamon and nutmeg", "74": "and vanilla extract", "75": "and vanilla extract for the frosting", "76": "and vanilla extract the consistency appears to be on the softer", "77": "and various fruit pieces like peaches", "78": "and warming spices cinnamon", "79": "and warming spices like cinnamon and nutmeg", "80": "and warming spices like cinnamon and nutmeg visible within the cake are chunks of walnuts and possibly raisins or other dried fruits", "81": "and warming spices like cinnamon and nutmeg visible within the cake layers are small specks of fruit or nuts", "82": "andouille sausage", "83": "angel food cake", "84": "apple", "85": "apple cider vinegar", "86": "apple filling apples", "87": "apple filling likely apples", "88": "apple filling likely sliced apples", "89": "apple slices", "90": "apples", "91": "appleshaped cutout decoration", "92": "apricot", "93": "apricots", "94": "apricots chopped", "95": "arge egg whites", "96": "arge eggs", "97": "arge eggs room temperature", "98": "arge eggs separated", "99": "arge onion chopped", "100": "arge onion finely diced", "101": "arge onion sliced", "102": "aromatic garam masala", "103": "artisan bread", "104": "arugula", "105": "asafoetida", "106": "asafoetida hing", "107": "asparagus", "108": "assorted bean", "109": "assorted beans", "110": "assorted cheeses blue cheese", "111": "assorted colorful sprinkles", "112": "assorted legumes", "113": "avocado", "114": "avocado slices", "115": "bacon", "116": "bacon bits", "117": "bacon strips", "118": "baguette", "119": "baked beans", "120": "baking powder", "121": "baking powdersoda", "122": "baking soda", "123": "baking sodapowder", "124": "baking_powder", "125": "baking_soda", "126": "balsamic glaze", "127": "balsamic vinegar", "128": "bamboo shoots", "129": "banana", "130": "banaspati ghee", "131": "banaspati oil", "132": "barbecue_sauce", "133": "basic donut dough", "134": "basil", "135": "basil leaves", "136": "basmati rice", "137": "bay leaf", "138": "bay leaf powder", 